cats_OG/app/controllers/cats_controller.rb

    def create
        kitty = Cat.new(cat_params)
        if kitty.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        kitty = Cat.find(params[:id])
        if kitty.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "white"], ["description", "                  sublime\r\n        \r\n        \r\n        "], ["updated_at", "2020-10-09 21:19:27.803908"], ["id", 13]]