cats new/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "white"], ["description", "            black\r\n    "], ["updated_at", "2023-02-11 01:27:21.871965"], ["id", 3]]
---
    def update
        cat = Cat.find_by(id: params[:id])
        if cat.update(cat_params)